"""
Створити словник як ключ якого буде 6-ти значне число,
 а в якості значень кортеж що складається з 2-х елементів - ім'я (str), вік (int).
Зробити близько 5-6 елементів словника.
Записати цей словник на диск у json-файл.
"""

import json

data = {
    123456: ('Іван', 25),
    234567: ('Марія', 30),
    345678: ('Петро', 22),
    456789: ('Ольга', 28),
    567890: ('Андрій', 35),
    678901: ('Наталя', 29)
}

with open('data.json', 'w') as json_file:
    json.dump(data, json_file, indent=4)

print("Словник був успішно записаний у файл 'data.json'")
