"""
Написати лямбда-функцію визначальну парне/непарне.
Функція приймає параметр (число) і якщо парне, видає слово “парне”, якщо ні - то “не парне”.
*Додаткове не обов'язкове завдання:
лямбда-функція вміє визначати як парне чи парне, а й число нуль.
"""

def examination(a):
    while True:
        if a.isdigit():
            return int(a)
        else:
            print('Будь ласка, введіть ціле число!')
            a = input('Спробуйте ще раз, введіть число:')


while True:
    pairing = lambda item: print('нуль') if item == 0 else print('парне') if item % 2 == 0 else print('непарне')
    pairing(examination((input('Введіть ваше число , а я його перевірю на парність! Ваше число: '))))
    print('Для виходу нажміть "Y"')
    exit = input()
    if exit.upper == 'Y':
        break
